In [2]:
import sys
print(sys.version)
import numpy as np
print(np.__version__)
import pandas as pd
print(pd.__version__)
import matplotlib.pyplot as plt

%matplotlib inline

3.6.5 |Anaconda, Inc.| (default, Apr 26 2018, 08:42:37)
[GCC 4.2.1 Compatible Clang 4.0.1 (tags/RELEASE_401/final)]
1.14.3
0.23.0

In [41]:
#11.05.1 - Use Pandas "read_csv()" function to import the gradebook_v2 file.
# Your code here
data = pd.read_csv('gradebook.csv', header = None)
data.columns = ['Name','Grade']
data

      Name  Grade
0     Alex     45
1      Ben     67
2     Carl     67
3    Sarah     85
4   Travis     89
5  Tamanna     96

In [43]:
#11.05.2 - As discussed, DataFrames are made up of Series. 
#Let's prove it. Extract any one Series from your DataFrame into a new variable. 
#Then, run the "type()" function on both your extracted Series and the entire DataFrame.

# Your code here
class_name = data['Name']
print(type(class_name))
print(type(data))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [76]:
#11.05.3 - Set the Index of your DataFrame to be equal to the values of the "student" variable, 
#and then drop the variable from the dataset. Note, you can do this as separate steps, 
#or using the "set_index()" function as described in 11.09.
#data.index = data['Name'].values
#data = data.set_index(data['Name'])
#data = data.drop('Name',axis= 1)
data
# Your code here

         Grade
Name
Alex        45
Ben         67
Carl        67
Sarah       85
Travis      89
Tamanna     96

In [98]:
#11.05.4 - Excellent! Now let's practice subsetting. Complete the following:
#Subset the DataFrame to only include Ben and Blake.
data.loc[['Ben','Carl']]
#Subset the DataFrame to only include students who scored under an 85 on the midterm.
data [(~data['Grade']) < 85]
#Subset the DataFrame to only include students who scored a B.
#Bonus:
#Subset the DataFrame to students who are missing a final score (hint - look up the "isnull()" function).
#Update your subset function to to use the "~" special character. That is, instead of [x < 4], try [~x < 4]. 
#What does this do?
#Use the "~" character to subset the DataFrame to students who are NOT missing a final score.
# Your code here

         Grade
Name
Alex        45
Ben         67
Carl        67
Sarah       85
Travis      89
Tamanna     96